# -*- coding: utf-8 -*-


CODE_SUCCEED = 200
CODE_FAIL = 400
CODE_ERROR = 500

CODE_MESSAGE = {
    200: '服务器成功返回请求的数据。',
    201: '新建或修改数据成功。',
    202: '一个请求已经进入后台排队（异步任务）。',
    204: '删除数据成功。',
    400: '发出的请求有错误，服务器没有进行新建或修改数据的操作。',
    401: '用户没有权限（令牌、用户名、密码错误）。',
    403: '用户得到授权，但是访问是被禁止的。',
    404: '发出的请求针对的是不存在的记录，服务器没有进行操作。',
    405: '发送的新建请求失败,返回空数据。',
    406: '请求的格式不可得。',
    410: '请求的资源被永久删除，且不会再得到的。',
    422: '当创建一个对象时，发生一个验证错误。',
    500: '服务器发生错误，请检查服务器。',
    502: '网关错误。',
    503: '服务不可用，服务器暂时过载或维护。',
    504: '网关超时。',
}

# token超时时间
EXPIRE_MINUTES = 24 * 60 * 365

# 新增的task需要在这里注册,在Monitor中缓存实例,在TemplateWorker中调用生成task,在RegiesterTask的ResultCallBack中注册回调函数
CELERY_TASK_INSTANCE = "_CELERY_TASK_INSTANCE"
